Chionsas/esp-thread-br-sonoff-donglem/examples/basic_thread_border_router/sdkconfig.defaults.sonoff_dongle_m
# Sonoff Dongle-M Stage 1 hardware baseline (ESP-IDF v5.5.4)
CONFIG_IDF_TARGET="esp32"

# 16 MB host flash. Conservative DIO/40 MHz works with the verified ESP32 module.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions-sonoff-dongle-m.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions-sonoff-dongle-m.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3584
CONFIG_ESP_MAIN_TASK_STACK_SIZE=5120

CONFIG_ESP_BR_BOARD_SONOFF_DONGLE_M=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0

# External stock Sonoff EFR32MG24 RCP: UART1, 115200 8N1, no flow control.
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_BORDER_ROUTER=y
CONFIG_OPENTHREAD_RADIO_SPINEL_UART=y
CONFIG_OPENTHREAD_SPINEL_ONLY=y
CONFIG_ESP_BR_RCP_UART_PORT=1
CONFIG_ESP_BR_RCP_UART_BAUDRATE=115200
CONFIG_PIN_TO_RCP_TX=13
CONFIG_PIN_TO_RCP_RX=17
CONFIG_PIN_TO_RCP_RESET=12
CONFIG_PIN_TO_RCP_BOOT=15
CONFIG_OPENTHREAD_RX_ON_WHEN_IDLE=n
CONFIG_OPENTHREAD_TASK_SIZE=8192
CONFIG_OPENTHREAD_RCP_COMMAND=y
CONFIG_OPENTHREAD_CLI_OTA=y

# The stock EFR32MG24 RCP image transmits at 0 dBm: mesh nodes hear this border
# router 15-25 dB weaker than they hear each other. 20 dBm is the MG24's maximum
# per Sonoff's hardware spec. Note the stock antenna is 3 dBi, putting this near
# 23 dBm EIRP against a 20 dBm EIRP regulatory ceiling in the EU -- 17 dBm is the
# compliant setting if that matters for your deployment.
CONFIG_ESP_BR_SET_RADIO_TX_POWER=y
CONFIG_ESP_BR_RADIO_TX_POWER_DBM=20
CONFIG_AUTO_UPDATE_RCP=n

# Dongle-M startup policy: Ethernet first, then saved Wi-Fi, then current
# upstream SoftAP provisioning/recovery.
CONFIG_EXAMPLE_CONNECT_WIFI=y
CONFIG_EXAMPLE_CONNECT_ETHERNET=y
CONFIG_EXAMPLE_USE_INTERNAL_ETHERNET=y
CONFIG_EXAMPLE_ETH_PHY_IP101=y
CONFIG_EXAMPLE_ETH_MDC_GPIO=23
CONFIG_EXAMPLE_ETH_MDIO_GPIO=18
CONFIG_EXAMPLE_ETH_PHY_RST_GPIO=5
CONFIG_EXAMPLE_ETH_PHY_ADDR=1
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_RMII_CLK_INPUT=y
CONFIG_ETH_RMII_CLK_IN_GPIO=0
CONFIG_OPENTHREAD_BR_AUTO_START=y
CONFIG_OPENTHREAD_BR_START_WEB=y
CONFIG_OPENTHREAD_BR_SOFTAP_SETUP=y
CONFIG_OPENTHREAD_CLI_WIFI=y
CONFIG_EXAMPLE_WIFI_CONN_MAX_RETRY=3
CONFIG_ESP_BR_DONGLE_M_ETHERNET_FAILURE_CONFIRM_MS=5000
CONFIG_ESP_BR_DONGLE_M_ETHERNET_RECOVERY_STABLE_MS=30000

CONFIG_LWIP_IPV6_FORWARD=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=12
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
CONFIG_LWIP_HOOK_IP6_INPUT_CUSTOM=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_HOOK_IP6_SELECT_SRC_ADDR_CUSTOM=y
CONFIG_LWIP_FORCE_ROUTER_FORWARDING=y
CONFIG_MBEDTLS_CMAC_C=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_ECJPAKE_C=y
CONFIG_MDNS_MULTIPLE_INSTANCE=y
CONFIG_MDNS_MAX_SERVICES=200
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
